<?xml version="1.0" ?>
<net name="2d_unet_decathlon" version="10">
	<layers>
		<layer id="0" name="mrimages" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 1, 128, 128"/>
			<output>
				<port id="0" names="Func/StatefulPartitionedCall/input/_0:0,mrimages:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAa/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="16, 1, 3, 3" size="576"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAa/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAa/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAa/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAa/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="576" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAa/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAa/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAa/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAa/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAa/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAb/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="640" shape="16, 16, 3, 3" size="9216"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAb/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAb/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAb/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAb/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="9856" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAb/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAb/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAb/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAb/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeAb/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/poolA/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/poolA/MaxPool:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBa/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="9920" shape="32, 16, 3, 3" size="18432"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBa/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBa/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBa/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBa/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="28352" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBa/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBa/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBa/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBa/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBa/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBb/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="28480" shape="32, 32, 3, 3" size="36864"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBb/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBb/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBb/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBb/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="65344" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBb/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBb/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBb/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBb/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeBb/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/poolB/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/poolB/MaxPool:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCa/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="65472" shape="64, 32, 3, 3" size="73728"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCa/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCa/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCa/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCa/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="139200" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCa/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCa/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCa/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCa/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCa/Relu:0,StatefulPartitionedCall/2DUNet_Brats_Decathlon/spatial_dropout2d/Identity:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCb/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="139456" shape="64, 64, 3, 3" size="147456"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCb/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCb/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCb/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCb/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="286912" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCb/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCb/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCb/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCb/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeCb/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/poolC/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/poolC/MaxPool:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDa/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="287168" shape="128, 64, 3, 3" size="294912"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDa/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDa/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDa/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDa/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="582080" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDa/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDa/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDa/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDa/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDa/Relu:0,StatefulPartitionedCall/2DUNet_Brats_Decathlon/spatial_dropout2d_1/Identity:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDb/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="582592" shape="128, 128, 3, 3" size="589824"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDb/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDb/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDb/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDb/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="1172416" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDb/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDb/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDb/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDb/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeDb/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/poolD/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/poolD/MaxPool:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEa/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="1172928" shape="256, 128, 3, 3" size="1179648"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEa/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEa/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEa/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEa/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="2352576" shape="1, 256, 1, 1" size="1024"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEa/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEa/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEa/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEa/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEa/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEb/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="2353600" shape="256, 256, 3, 3" size="2359296"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEb/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEb/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEb/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEb/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="4712896" shape="1, 256, 1, 1" size="1024"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEb/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEb/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEb/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEb/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/encodeEb/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/conv2d_transpose/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="4713920" shape="256, 128, 2, 2" size="524288"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/conv2d_transpose/ReadVariableOp:0" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/Shape/GatherNCHWtoNHWC_input_port_1/value36887009" type="Const" version="opset1">
			<data element_type="i32" offset="5238208" shape="4" size="16"/>
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/Shape/GatherNCHWtoNHWC_input_port_2/value36906787" type="Const" version="opset1">
			<data element_type="i64" offset="5238224" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/Shape/GatherNCHWtoNHWC" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/Shape:0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i64" offset="5238224" shape="1" size="8"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/strided_slice/stack:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i64" offset="5238232" shape="1" size="8"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/strided_slice/stack_1:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i64" offset="5238232" shape="1" size="8"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/strided_slice/stack_2:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/strided_slice:0" precision="I32"/>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/stack/Unsqueeze_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="5238224" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/stack/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/stack/Unsqueeze274" type="Const" version="opset1">
			<data element_type="i32" offset="5238240" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/stack/Unsqueeze276" type="Const" version="opset1">
			<data element_type="i32" offset="5238240" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/stack/Unsqueeze278" type="Const" version="opset1">
			<data element_type="i32" offset="5238244" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/stack" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/conv2d_transpose/GatherNHWCtoNCHW_input_port_1/value37126928" type="Const" version="opset1">
			<data element_type="i32" offset="5238248" shape="4" size="16"/>
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/conv2d_transpose/GatherNHWCtoNCHW_input_port_2/value37146724" type="Const" version="opset1">
			<data element_type="i64" offset="5238224" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/conv2d_transpose/GatherNHWCtoNCHW" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/conv2d_transpose/ss_0_port_input_port_1/value60787000" type="Const" version="opset1">
			<data element_type="i64" offset="5238264" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/conv2d_transpose/ss_0_port_input_port_2/value60806883" type="Const" version="opset1">
			<data element_type="i64" offset="5238272" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/conv2d_transpose/ss_0_port_input_port_3/value60826766" type="Const" version="opset1">
			<data element_type="i64" offset="5238232" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/conv2d_transpose/ss_0_port" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="1" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/conv2d_transpose/Cast_2" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/conv2d_transpose" type="ConvolutionBackpropData" version="opset1">
			<data auto_pad="same_lower" dilations="1, 1" output_padding="0, 0" pads_begin="0, 0" pads_end="0, 0" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/conv2d_transpose:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="5238280" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvE/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/concatD/concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/concatD/concat:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCa/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="5238792" shape="128, 256, 3, 3" size="1179648"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCa/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCa/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCa/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCa/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="6418440" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCa/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCa/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCa/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCa/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCa/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCb/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="6418952" shape="128, 128, 3, 3" size="589824"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCb/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCb/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCb/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCb/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="7008776" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCb/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCb/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCb/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCb/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/decodeCb/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvC/conv2d_transpose/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="7009288" shape="128, 64, 2, 2" size="131072"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvC/conv2d_transpose/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvC/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvC/Shape/GatherNCHWtoNHWC_input_port_1/value36946988" type="Const" version="opset1">
			<data element_type="i32" offset="5238208" shape="4" size="16"/>
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvC/Shape/GatherNCHWtoNHWC_input_port_2/value36966910" type="Const" version="opset1">
			<data element_type="i64" offset="5238224" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="96" name="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvC/Shape/GatherNCHWtoNHWC" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="StatefulPartitionedCall/2DUNet_Brats_Decathlon/transconvC/Shape:0" precision="I32">
